import Container from "../common/container/Container";
import {
    StyledNewLifeConnector,
    StyledSectionWrapper,
    StyledNewLifeText,
} from "./NewLife.styled";

const NewLive = () => {
    return (
        <>
            <StyledNewLifeConnector></StyledNewLifeConnector>
            <StyledSectionWrapper>
                <Container>
                    <StyledNewLifeText>
                        Дорогі українці! Якщо ви вимушено покинули свою країну і
                        зараз перебуваєте в новому місці, це може бути непростим
                        досвідом. Проте, з правильними порадами та інформацією
                        ви зможете легше адаптуватися до нових умов. Ось кілька
                        корисних рекомендацій:
                        <br />
                        <br />
                        <b>Ознайомтесь із новою культурою:</b>
                        <ul>
                            <li>
                                Досліджуйте звичаї та традиції: Кожна країна має
                                свої культурні особливості. Ознайомтеся з
                                основними традиціями, святами та звичаями, щоб
                                краще розуміти людей навколо вас.
                            </li>

                            <li>
                                Вивчайте мову: Вивчення мови — це один із
                                найважливіших кроків адаптації. Знання мови
                                країни допоможе вам спілкуватися з місцевими
                                жителями, знаходити роботу та інтегруватися в
                                нове середовище.
                            </li>

                            <br />
                        </ul>
                        <b>Налагоджуйте соціальні зв’язки:</b>
                        <ul>
                            <li>
                                Шукайте українську громаду: У багатьох містах
                                існують українські громади, де ви можете знайти
                                підтримку та дружнє оточення.
                            </li>
                            <li>
                                Залучайтеся до місцевих заходів: Беріть участь у
                                заходах, організованих вашою новою громадою. Це
                                допоможе вам знайти нових друзів і відчути себе
                                частиною спільноти.
                            </li>
                        </ul>
                        <b>Організуйте своє житло:</b>
                        <ul>
                            <li>
                                Знайдіть комфортне житло: Якщо ви ще не маєте
                                постійного місця проживання, постарайтеся знайти
                                комфортне та доступне житло. Можливо, вам слід
                                звернутися до організацій, які допомагають
                                біженцям у пошуку житла.
                            </li>
                            <li>
                                Знайте свої права: Досліджуйте свої права як
                                іммігранта у новій країні. Це може включати
                                доступ до соціальних послуг, охорони здоров'я та
                                освіти.
                            </li>
                        </ul>
                        <b>Підтримуйте своє психічне здоров'я:</b>
                        <ul>
                            <li>
                                Не соромтеся звертатися за допомогою: Якщо ви
                                відчуваєте стрес або тривогу, важливо звернутися
                                за допомогою. У багатьох країнах є організації,
                                які пропонують безкоштовну психологічну
                                підтримку для біженців.
                            </li>
                            <li>
                                Займайтеся спортом і творчістю: Залишайтеся
                                активними, займаючись спортом або творчістю. Це
                                допоможе зняти напругу і покращити загальний
                                стан.
                            </li>
                        </ul>
                        <b>Інформація про роботу та освіту:</b>
                        <ul>
                            <li>
                                Досліджуйте ринок праці: Ознайомтесь із попитом
                                на спеціальності у новій країні. Якщо необхідно,
                                пройдіть додаткові курси або навчання.
                            </li>
                            <li>
                                Визначте свої навички: Оцініть свої навички та
                                досвід. Це може допомогти вам знайти роботу, яка
                                відповідатиме вашим здібностям.
                            </li>
                        </ul>
                        <b>Відкритість до нових можливостей:</b>
                        <ul>
                            <li>
                                Будьте відкритими до нового досвіду: Адаптація
                                до нової країни може бути викликом, але вона
                                також надає нові можливості. Будьте готові до
                                нових знайомств і досвіду, які можуть змінити
                                ваше життя.
                            </li>
                            <li>
                                Сподіваємося, ці поради допоможуть вам
                                адаптуватися до нової країни. Пам’ятайте, що ви
                                не самі — є багато людей і організацій, готових
                                допомогти вам у цей непростий час. Ваша
                                сміливість і рішучість обов’язково приведуть до
                                кращого майбутнього!
                            </li>
                        </ul>
                    </StyledNewLifeText>
                </Container>
            </StyledSectionWrapper>
        </>
    );
};
export default NewLive;
