const UpArrowSvg = (props) => (
    <svg
        xmlns="http://www.w3.org/2000/svg"
        width={24}
        height={24}
        viewBox="0 0 64 64" // Уменьшаем область видимости для центровки и масштабирования стрелки
        fill="white" // Цвет стрелки
        {...props}
    >
        <path d="M32 12L12 32c-1.562 1.562-1.562 4.094 0 5.656 1.563 1.562 4.094 1.562 5.656 0L32 22.343 46.344 37.656c1.562 1.562 4.094 1.562 5.656 0 1.563-1.562 1.563-4.094 0-5.656L32 12z" />
    </svg>
);
export default UpArrowSvg;
