import {
    StyledWorkImage,
    StyledWorkSection,
    StyledWorkSubtitle,
    StyledWorkTextContent,
    StyledWorkLink,
} from "./Work.styled";
import Container from "../common/container/Container";
import peopleImage from "../../assets/construction.webp";
import StyledSectionHeader from "../common/sectionHeader/SectionHeader.styled";

const Work = () => {
    return (
        <Container>
            <StyledSectionHeader>Пошук роботи</StyledSectionHeader>
            <StyledWorkSection>
                <StyledWorkTextContent>
                    <StyledWorkImage src={peopleImage} alt="людина" />
                    <StyledWorkSubtitle>Що треба?</StyledWorkSubtitle>
                    <p>
                        Насамперед потрібна мова. Більшість роботодавців
                        вимагають рівень мови В1, причому багатьом буде
                        достатньо сертифіката із зазначеним рівнем. Англійська
                        мова це дуже великий плюс, але, на жаль, не панацея.
                        Можна спробувати знайти роботу без мови, але швидше за
                        все вам знадобиться міцна спина і витривалі ноги.
                    </p>
                    <p>
                        Так само треба мати бажання працювати, бо якщо його
                        немає, то ви знайдете 10001 причину що б нічого не
                        робити.
                    </p>
                    <StyledWorkSubtitle>Як підготуватись?</StyledWorkSubtitle>
                    <p>
                        Крім вивчення мови бажано схвалити свої дипломи, на
                        даному етапі це робиться безкоштовно, необхідно лише{" "}
                        <StyledWorkLink
                            href="https://hkdir.no/"
                            rel="noopener noreferrer"
                            target="_blank"
                        >
                            заповнити форму
                        </StyledWorkLink>{" "}
                        та прикріпити перекладені документи. Освіта впливає на
                        пошук роботи і на рівень зарплати, хоча іноді може
                        зіграти негативну роль - ви можете отримати відмову
                        через "надто високу кваліфікацію" за яку переплачувати
                        не хочуть.
                    </p>
                    <p>
                        Швидше за все ви будете проходити практику на етапі
                        інтеграційної програми, і вам необхідно крім мозолів
                        отримати навички спілкування норвезькою та знайомства.
                        Знайомства в Норвегії дуже важливі, тому що норвежці
                        дуже недовірливі і знайомства можуть важити більше, ніж
                        кваліфікація.
                    </p>
                    <p>
                        Потрібно зробити резюме, швидше за все, вам порадять як
                        його краще оформити, під час занять. Можемо лише
                        порадити ресурс, де його{" "}
                        <StyledWorkLink
                            href="https://www.canva.com/"
                            rel="noopener noreferrer"
                            target="_blank"
                        >
                            зручно зробити
                        </StyledWorkLink>
                        .
                    </p>
                    <StyledWorkSubtitle>Де шукати?</StyledWorkSubtitle>
                    <p>
                        Є два основних інтернет ресурси для пошуку роботи:{" "}
                        <StyledWorkLink
                            href="https://www.finn.no/"
                            rel="noopener noreferrer"
                            target="_blank"
                        >
                            перший
                        </StyledWorkLink>{" "}
                        та{" "}
                        <StyledWorkLink
                            href="https://arbeidsplassen.nav.no/"
                            rel="noopener noreferrer"
                            target="_blank"
                        >
                            другий
                        </StyledWorkLink>
                        . Можна дізнатися інформацію в NAV і куратора по
                        інтропрограмі. До речі, є ймовірність, що на тій
                        практиці, яку він вам знайшов, вам запропонують першу
                        роботу. Ще один варіант це моніторити веб сайти
                        компаній, що вас цікавлять, на наявність відкритих
                        вакансій або ходити по місту пропонуючи свої послуги,
                        але реально так змогли знайти роботу три з половиною
                        людини. Дієвим варіантом є запитувати у знайомих
                        норвежців, але є ймовірність, що завести тісні
                        знайомства з норвежцями так само просто, як і знайти
                        роботу самостійно. Але ми всі люди різні з різними
                        талантами та можливостями.
                    </p>
                    <StyledWorkSubtitle>
                        Яка вона, перша робота?
                    </StyledWorkSubtitle>
                    <p>
                        Я впевнений на 100% що крутіші фахівці ніж ми в світі ще
                        просто не народилися, але реальність така що багатьом
                        доведеться занизити очікування і починати все з початку.
                        Безумовно, хтось зможе знайти роботу за своєю професією
                        або близько того. І так само багатьом доведеться
                        починати з чого завгодно щоб отримати свій перший
                        відгук, свій перший досвіду новій країні. Далі буде
                        краще.
                    </p>
                    <p>
                        Також дуже велика ймовірність, що перша робота не
                        постійна, а тимчасова або часткова зайнятість. У
                        Норвегії це абсолютна норма, тому що з постійної роботи
                        людини важко звільнити і тому перед тим, як
                        запропонувати людині повну зайнятість у ній повинні бути
                        впевнені. Випробувних кілька місяців це теж норма і не
                        тільки на першій роботі.
                    </p>
                    <StyledWorkSubtitle>Що хорошого?</StyledWorkSubtitle>
                    <p>
                        У Норвегії непогані зарплати, дивлячись на ціни на
                        продукти, дивно було б якби зарплата була така ж як в
                        Україні.
                    </p>
                    <p>
                        Ще один плюс це те, що навіть низькокваліфіковані
                        профессії по зарплатї не відстають. Орієнтовну зарплату
                        можна дізнатися на сайті, це допоможе уникнути обману.
                    </p>
                    <p>
                        Зарплати офіційні, а це означає, що в теорії
                        пропрацювавши 10 років можна розраховувати на норвезьку
                        пенсію, нехай і мінімальну. Перетерпівши всі труднощі і
                        дійшовши до роботи за своїм профілем, можна буде подати
                        документи на робочу візу, але це вже зовсім інша
                        історія.
                    </p>
                </StyledWorkTextContent>
            </StyledWorkSection>
        </Container>
    );
};

export default Work;
